[
  {
    "id": 1,
    "title": "How to Plan a Custom Software Project Without Rework",
    "category": "Custom Software",
    "image": "https://images.unsplash.com/photo-1518770660439-4636190af475?q=80&w=1200&auto=format&fit=crop",
    "author": "Mind Manthan Editorial",
    "date": "January 15, 2026",
    "excerpt": "A practical framework to define scope, workflows, integrations, and rollout phases before development starts.",
    "content": "Successful custom software starts with process mapping, not code. We run discovery workshops, convert workflows to system modules, and align milestones with measurable outcomes.\n\nThe result is faster delivery, fewer change requests, and predictable cost control."
  },
  {
    "id": 2,
    "title": "Modern Website Architecture for Performance and SEO",
    "category": "Web Development",
    "image": "https://images.unsplash.com/photo-1498050108023-c5249f4df085?q=80&w=1200&auto=format&fit=crop",
    "author": "Mind Manthan Editorial",
    "date": "January 8, 2026",
    "excerpt": "Build websites that load fast, rank better, and convert visitors with technical SEO-first engineering.",
    "content": "Websites that perform well combine fast rendering, strong information architecture, and technical SEO hygiene.\n\nOur teams implement structured metadata, Core Web Vitals optimization, and scalable CMS workflows to support long-term growth."
  },
  {
    "id": 3,
    "title": "Mobile App Delivery Blueprint for Android, iOS, and Hybrid",
    "category": "Mobile Apps",
    "image": "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?q=80&w=1200&auto=format&fit=crop",
    "author": "Mind Manthan Editorial",
    "date": "December 30, 2025",
    "excerpt": "How to choose native vs hybrid architecture and ship enterprise-grade mobile apps confidently.",
    "content": "Choosing the right mobile architecture depends on release speed, performance requirements, and integration complexity.\n\nWe design release pipelines for Android, iOS, and hybrid apps with automated quality checks and robust production monitoring."
  },
  {
    "id": 4,
    "title": "IoT Solutions for Real-Time Operations Monitoring",
    "category": "IoT",
    "image": "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?q=80&w=1200&auto=format&fit=crop",
    "author": "Mind Manthan Editorial",
    "date": "December 19, 2025",
    "excerpt": "From sensors to dashboards: how IoT data pipelines improve uptime, quality, and operational visibility.",
    "content": "IoT success requires secure edge-to-cloud architecture, dependable ingestion, and role-based visibility.\n\nWe build connected systems with device management, alerting, and analytics dashboards that support quick decisions in real time."
  },
  {
    "id": 5,
    "title": "HRMS and ERP Modernization: A Step-by-Step Approach",
    "category": "ERP/HRMS",
    "image": "https://images.unsplash.com/photo-1552664730-d307ca884978?q=80&w=1200&auto=format&fit=crop",
    "author": "Mind Manthan Editorial",
    "date": "December 10, 2025",
    "excerpt": "Upgrade HR and business systems with zero-disruption migration and better process control.",
    "content": "Modern HRMS and ERP platforms reduce manual workload and create a single source of truth.\n\nOur migration model includes data mapping, phased rollout, user training, and post-launch support to ensure adoption."
  },
  {
    "id": 6,
    "title": "Data Security by Design for Business Applications",
    "category": "Security",
    "image": "https://images.unsplash.com/photo-1563986768609-322da13575f3?q=80&w=1200&auto=format&fit=crop",
    "author": "Mind Manthan Editorial",
    "date": "November 28, 2025",
    "excerpt": "Implement role-based access, encryption, and secure deployment patterns from day one.",
    "content": "Security should be engineered into architecture, CI/CD, and operations.\n\nWe implement access controls, encrypted storage, audit-ready logs, and hardened deployment pipelines to reduce operational risk."
  },
  {
    "id": 7,
    "title": "Workflow Automation That Removes Operational Bottlenecks",
    "category": "Automation",
    "image": "https://images.unsplash.com/photo-1454165804606-c3d57bc86b40?q=80&w=1200&auto=format&fit=crop",
    "author": "Mind Manthan Editorial",
    "date": "November 20, 2025",
    "excerpt": "Automate approvals, communication, and reporting to improve turnaround and transparency.",
    "content": "Automation works best when mapped to clear ownership and measurable KPIs.\n\nWe develop custom dashboards, reporting tools, and business process orchestration that cuts cycle time and manual errors."
  },
  {
    "id": 8,
    "title": "Cloud and DevOps Foundations for Reliable Releases",
    "category": "Cloud & DevOps",
    "image": "https://images.unsplash.com/photo-1451187580459-43490279c0fa?q=80&w=1200&auto=format&fit=crop",
    "author": "Mind Manthan Editorial",
    "date": "November 12, 2025",
    "excerpt": "A practical guide to CI/CD, containerization, monitoring, and infrastructure optimization.",
    "content": "Release reliability comes from automation and observability.\n\nOur DevOps setup includes CI/CD pipelines, Docker-based deployment, centralized logging, and proactive system health monitoring."
  },
  {
    "id": 9,
    "title": "API Integration and Long-Term Technical Support Strategy",
    "category": "API & Support",
    "image": "https://images.unsplash.com/photo-1516116216624-53e697fedbea?q=80&w=1200&auto=format&fit=crop",
    "author": "Mind Manthan Editorial",
    "date": "November 4, 2025",
    "excerpt": "Connect third-party systems and maintain business-critical platforms with structured support models.",
    "content": "API integration should be stable, secure, and measurable with clear fallback handling.\n\nWe provide custom API development, third-party integrations, performance optimization, and long-term maintenance contracts."
  }
]

